time = int(input('Введите количество секунд '))

if time < 60: # проверка введенного числа, больше или не более минуты
    print('Вы ввели', time, ' секунд')
else:
    if time < 3600:  # проверка введенного числа, больше или не более часа
        minute = time % 86400 % 3600 // 60
        sek = time % 86400 % 3600 % 60
        print("Вы ввели ", minute, "минут", sek, "секунд")
    else:
        if time < 86400: # проверка введенного числа, больше или не более суток
            haur = time % 86400 // 3600
            minute = time % 86400 % 3600 // 60
            sek = time % 86400 % 3600 % 60
            print("Вы ввели ", haur, "часов", minute, "минут", sek, "секунд")
        else:
            day = time // 86400
            haur = time % 86400 // 3600
            minute = time % 86400 % 3600 // 60
            sek = time % 86400 % 3600 % 60

            print("Это ", day, "дней", haur, "часов", minute, "минут", sek, "секунд")


